# Brewfile
# Usage: brew bundle install

tap "aws/tap"
tap "grishka/grishka"
tap "productdevbook/tap"
tap "siderolabs/tap"
tap "th-ch/youtube-music"

# Core tools
brew "coreutils"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "gh"
brew "wget"
brew "tree"
brew "htop"

# Editor / Terminal
brew "neovim"
brew "tmux"
brew "lazygit"

# Languages
brew "mise"
brew "go"
brew "rust"
brew "pnpm"

# Mobile / App dev
brew "fastlane"
brew "gradle"
brew "maven"
brew "xcodegen"
brew "jadx"

# Infra / Cloud
brew "helm"
brew "kubectx"
brew "kubernetes-cli"
brew "k9s"
brew "krew"
brew "talosctl"
brew "tfenv"
brew "terragrunt"
brew "aws/tap/lightsailctl"
brew "siderolabs/tap/talosctl"

# Network
brew "nmap"
brew "iperf3"
brew "iproute2mac"
brew "wireshark"

# Other
brew "act"
brew "awscli"
brew "ffmpeg"
brew "gemini-cli"
brew "imagemagick"
brew "mas"
brew "mysql-client"
brew "pipx"
brew "portaudio"
brew "watchman"

# Apps
cask "1password-cli"
cask "alacritty"
cask "alt-tab"
cask "android-studio"
cask "appcleaner"
cask "aqua-voice"
cask "audacity"
cask "balenaetcher"
cask "blockbench"
cask "capcut"
cask "chatgpt"
cask "claude"
cask "codex"

cask "discord"
cask "firefox"
cask "gather"
cask "gcloud-cli"
cask "google-chrome"
cask "grishka/grishka/neardrop"
cask "intellij-idea"
cask "karabiner-elements"
cask "obs"
cask "orbstack"
cask "pgadmin4"
cask "postman"
cask "prism-launcher"
cask "productdevbook/tap/portkiller"
cask "raycast"
cask "rectangle"
cask "scroll-reverser"
cask "sequel-ace"
cask "slack"
cask "steam"
cask "tailscale"
cask "th-ch/youtube-music/youtube-music"
cask "thunderbird"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "zed"

# Setapp (CleanMyMac, CleanShot X などはSetapp経由で管理)
cask "setapp"

# Mac App Store
mas "LINE", id: 539883307
mas "Chatwork", id: 715278675
mas "Xcode", id: 497799835


